#/usr/bin/python3
#-*- coding:utf-8 -*-

#   #   #   功能: 录制中文语音，读出要求翻译后的语音
#   #   问题: 语音识别
#                   语音录制
#                       已经解决( 5秒录音 )
#                   文件格式转换
#                       使用ffmpeg进行转码( 在测试 )
#                   上传识别成字符串
#                   返回识别出的字符串

#   #   问题: 字符串翻译
#                   接受一个字符串
#                   翻译成要求语音字符串
#                   返回翻译后的字符串

#   #   问题: 语音合成
#                   接受翻译后的字符串
#                   语音合成
#                   返回语音文件

#   #   问题: 语音播放
#                   播放语音合成的文件

if__name__=="__main__":

    

    
